cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'homebrew/bundle'
tap 'homebrew/dupes'

brew 'coreutils'
brew 'moreutils'
brew 'findutils'
brew 'imagemagick'
brew 'openssl'
brew 'mysql'
brew 'mongodb'
brew 'postgresql'
brew 'redis'
brew 'unrar' # unarchive rar files
brew 'gpg' # resource signer
brew 'wget' # better curl
brew 'yarn' # node package manager
brew 'youtube-dl' # download youtube vids
brew 'android-sdk' # android sdk and tools
brew 'gradle' # android build system
brew 'htop' # better top
brew 'watchman'
brew 'ack' # text search
brew 'the_silver_searcher' # better ack: ag
brew 'tree' # directory tree view
brew 'readline'
brew 'jpegoptim' # optimise jpegs
brew 'terminal-notifier' # macos growl messages from terminal
brew 'micro' # terminal editor
brew 'z' # directory changer
brew 'rbenv' # ruby version manager
brew 'fzf' # fuzzy search
brew 'vim' # vim8

cask 'google-chrome'
cask 'google-drive'
cask 'dropbox'
cask 'evernote'
cask 'kindle'
cask 'amphetamine'
cask 'firefox'
cask '1password'
cask 'atom'
cask 'slack'
cask 'vlc'
cask 'iterm2'
cask 'sourcetree'
cask 'transmit'
cask 'micro-snitch'
cask 'sequel-pro'
cask 'postman'
cask 'sketch'
cask 'flux'
cask 'spotify'
cask 'numi'
cask 'menubar-stats'
cask 'avast'
cask 'android-studio'
cask 'kap'
