cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'puma/puma'

brew 'ack'
brew 'coreutils'
brew 'moreutils'
brew 'findutils'
brew 'imagemagick'
brew 'libgit2'
brew 'openssl'
brew 'readline'
brew 'mysql'
brew 'mongodb'
brew 'postgresql'
brew 'puma/puma/puma-dev'
brew 'roundup'
brew 'spaceman-diff'
brew 'spark'
brew 'unrar'
brew 'gnupg'
brew 'gnupg2'
brew 'wget'
brew 'yarn'
brew 'youtube-dl'
brew 'gradle'
brew 'watchman'

cask 'google-chrome'
cask 'google-drive'
cask 'dropbox'
cask 'firefox'
cask '1password'
cask 'atom'
cask 'slack'
cask 'vlc'
cask 'iterm2'
cask 'sourcetree'
cask 'transmit'
cask 'micro-snitch'
cask 'sequel-pro'
cask 'postman'
cask 'sketch'
cask 'flux'
cask 'spotify'
cask 'numi'
cask 'menubar-stats'
cask 'avast'
