cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'homebrew/bundle'
tap 'homebrew/dupes'

brew 'coreutils'
brew 'moreutils'
brew 'findutils'
brew 'imagemagick'
brew 'openssl'
brew 'mysql'
brew 'mongodb'
brew 'postgresql'
brew 'unrar'
brew 'gpg'
brew 'wget'
brew 'yarn'
brew 'youtube-dl'
brew 'gradle'
brew 'android-sdk'
brew 'htop'
brew 'watchman'
brew 'ack'
brew 'the_silver_searcher'
brew 'tree'
brew 'readline'
brew 'jpegoptim'

cask 'google-chrome'
cask 'google-drive'
cask 'dropbox'
cask 'evernote'
cask 'kindle'
cask 'amphetamine'
cask 'firefox'
cask '1password'
cask 'atom'
cask 'slack'
cask 'vlc'
cask 'iterm2'
cask 'sourcetree'
cask 'transmit'
cask 'micro-snitch'
cask 'sequel-pro'
cask 'postman'
cask 'sketch'
cask 'flux'
cask 'spotify'
cask 'numi'
cask 'menubar-stats'
cask 'avast'
cask 'android-studio'
